/*
 *******************************************************************
 *						Audio Common Definitions
 *
 *Note(s):
 *		 (1)Only macro definitions can be defined here.
 *		 (2)Use (1UL << (n)) instead of BIT(n)
 *******************************************************************
 */
#ifndef _AUDIO_DEF_H_
#define _AUDIO_DEF_H_

/*
 *******************************************************************
 *						DAC Definitions
 *******************************************************************
 */

/*
 *******************************************************************
 *						ADC Definitions
 *******************************************************************
 */

/*mic工作模式定义*/
#define AUDIO_MIC_CAP_MODE			0	//单端隔直电容模式
#define AUDIO_MIC_CAP_DIFF_MODE		1	//差分隔直电容模式
#define AUDIO_MIC_CAPLESS_MODE		2	//单端省电容模式

/*
 *******************************************************************
 *						Linein(Aux) Definitions
 *******************************************************************
 */


/*
 *******************************************************************
 *						ANC Definitions
 *******************************************************************
 */
//ANC Mode Enable
#define ANC_FF_EN 		 			(1UL << (0))
#define ANC_FB_EN  					(1UL << (1))
#define ANC_HYBRID_EN  			 	(1UL << (2))


//数据饱和位宽定义
#define  BIT_WIDE_16BIT  			0
#define  BIT_WIDE_24BIT  			1

#endif/*_AUDIO_DEF_H_*/
